{
    "A" : {
        "Aaron" : "An * is likely untrustworthy. He will, quite frankly, be bad at covering it up, but he has a way of making you overlook things.\nIf you're not careful, you will stop seeing the red flags and start making excuses for them. Don't go there.",
        "Alexis" : "*es are liked by pretty much everyone, and for good reason. They're outgoing and comfortable in social situations, and they know how to keep a crowd engaged.\nThey're not necessarily the best at reading the room, so keep that in mind, whatever that may mean for your situation with them (social/dating/etc.)",
        "Alexus" : null,
        "Alia" : "Please do yourself a favor and do not, under any circumstances, get close to an *.\nShe likely seems innocent enough on the outside, but she'll very quickly draw you into her mess and coerce you into 'helping' her.\nIf you're too kindhearted to say no, help from afar. If you're not, disengage right away and thank me later.\nShe's a drama queen of obscene proportions. Don't let her fool you. She may mean well, but she will drag you into a state of no longer meaning well quite easily. Be careful.",
        "Ali" : "Your *'s a 50-50 split. She's either annoying or quiet, but neither are to a high degree.\nIf she's an annoying one, it's not so incredibly annoying that you can't stand her. You'll probably end up being friends, too- it's the type of annoying that eventually turns to endearing.\nIf she's a quiet one, she's not painfully introverted, but don't be surprised if you have to make the first move if you want to talk to her.",
        "Aly" : null,
        "Alli" : null,
        "Ally" : null,
        "Alison" : null,
        "Alisyn" : null,
        "Alyson" : null,
        "Allison" : null,
        "Allisyn" : null,
        "Allyson" : null,
        "Aliana" : "*s can be kind of rough to deal with.\nThey do anything to get what they want, and will propably manipulate you into helping them.\n*s also tend to be drama queens. If you're not into that, then watch your back.",
        "Aliyana" : null,
        "Alyana" : null,
        "Amanda" : "*s are hardheaded and stubborn, but you will love them.\nThey're hilariously funny, whether you share their direct sense of humor or not.\nYou'll need to be patient with your *- that aforementioned stubbornness can get in the way of your relationship if you let it. Work through it and you'll be golden.",
        "Andrew" : "*s are interesting men. They're not inherently bad or good to keep around, but you will need to stay aware.\nThey do not know how to express themselves very well despite having a lot to say. They can also be rather wishy-washy in their decision making, and it will be visible/palpable even if they do not tell you.\nThey're likely to be introverted and relatively softspoken, but if you establish mutual trust and are patient, your * will open up to you. They can be good friends despite their many quirks.",
        "Andy" : "*s are absolute sweethearts in every way. They have a great sense of humor and a smile for every day of the week.\nKeep your * close, and be nice to him. He deserves it.",
        "A Advice" : "Overall, quite an interesting bunch. Many A names are a bit crazy and a little strange, but in an oddly endearing way. They're great friends once you get to know them.\nThey usually hold a few traits that seem a little 'much' to handle or are simply annoying, but they are typically easy to look past.\nIf you're willing to get to know an A on a deeper level, they're cool to hang around."
    },

    "B" : {
        "Bobby" : "Moreso than their Robert counterparts, *s are slightly childish. They are likely holding onto some things from their formative years, including their nickame.\nBy the time they grow up - however long that takes them - *s have shed their former nicknames and embraced a more mature self.",
        "B Advice" : "Bs are good at knowing who likes what kind of treatment. Don't pin them as kiss-ups immediately (although you'll find your fair share of those here).\nIn reality, Bs just know how to do 1:1 interaction very well. They have very good senses for what behavior from them will get them in the door with what people.\nIn other words, Bs are very good code-switchers. This doesn't inherently make them fake, but if that's their intent, they'll be quite good at it.\n9 times out of 10, though, your B is pure-intentioned and an absolute sweetheart."
    },

    "C" : {
        "Caleb" : "*s are all distinct. He'll be an eclictic person with strong opinons. A little bit on the eccentric side, he's either involved in theatre or generally theatric.\nHe'll talk to you for hours and not really say anything about himself; if you want to get to know him, it'll probably have to be 1-on-1;",
        "Carson" : "* is far smarter than he should be or even needs to be, within reason. He catches onto logical things quickly.\nHe understands logical things, but emotional intelligence evades him. It'll take him longer to catch onto those things than you might. Be patient.",
        "Charlotte" : "She's a bit odd, definitely a weird one. Has a high propensity for questionable behavior and will probably annoy you in some fashion or another, but can be cool in specific situations.",
        "Chris" : "Be prepared to be in for the long haul if you want to really know your *.\nHe's laid-back to a fault, so much so that it'll take time for you to learn his actual personality traits.\nHe's not at all confrontational and drama repels him, but that can work against you if you are waiting for him to express his feelings. \nHe's not very emotionally expressive. Be patient with him; he needs time to get comfortable with you.",
        "Christian" : null,
        "Christopher" : null,
        "Conner" : "*s are very impressionable, and they're easily led by others. They don't have a strong sense of self, and the people who they engage with will heavily influence who they become.\nChoose your Conner carefully; he needs time to grow up.",
        "Connor" : null,
        "C Advice" : "Cs are interesting because no matter what phase of life you find them in, you'll always meet some that seem to be far beyond or far behind their years.\nAs a whole, they aren't the most emotional people. They're not very in touch with that side of themselves, and it usually takes someone of another letter to draw that out of them.\nCs are altogether agreeable, though, and will make good friends in an array of situations.\nIf you want one of them to emotionally invest in you, or you want to emotionally pour into them, you need patience, patience, patience. It will be worth it."
    },

    "D" : {
        "Dan" : "Your * may strike you as hard to approach at first. He seems a little serious and academic, perhaps, in a way that says 'don't approach me'. But do approach him!.\n*s aren't the easiest people to get to know, but once you do, you'll open up a world of conversation and the potential for a lifelong relationship with them.",
        "Danny" : "*, your sweet, precious *. He's going to be childish for a little longer than everyone else, but he's largely high-spirited and fun to have around.\nHe's likely emotionally driven and can be quick to oscillate between the highs of different feelings. Be mindful of that- a stray comment you think nothing of might affect your * more than you anticipate.\nAltogether gentle and fun-loving guys, you can't go wrong with a *.",
        "Daniel" : "You'll often catch a * in a stoic mood.\nHe has a great sense of humor and is personable enough, but if you were to look over at him when his face is in a resting state, you may be intimidated.\nDon't let that deter you. *s are sweethearts; they'll always have the time of day for anyone who asks.",
        "Danielle" : "*s are very outgoing and outspoken; they thrive in social settings. They love sharing their thoughts and time with others.\nAt first blush, your * may seem spacey or forgetful, but don't let that cement your opinion of her. She's intelligent, and especially knowledgeble in things she cares about.",
        "David" : "It's 'my way or the high way' with *s. You have to leave them alone in terms of letting them grow up- they will not learn by someone telling them what not to do.\nThey thrive on personal experience and will only wish to do the things you tell them not to do. Push them too far and they will lash out, whether emotionally or physically.\nGive them space to thrive and discover life for themselves and they'll come back down.",
        "Donovan" : "*s are crazy. Fair warning, you will not know that until you stop knowing them. They'll likely have great social upstanding.\nThey make themselves easy to love and are loved by many- it's likely that the people closest to them are just as enamored as you were.",
        "D Advice" : "D names are loud, present, and want to be in charge of their situation.\nThey tend to be extroverted as a group, and enjoy being either the center of attention or being the reason why the person who is center of attention is there in the first place.\nIf you ever need a person who's good at planning events, is sociable, and seems to at least know of everyone, a D name is your best bet.\nThey're highly intelligent and practically, and will likely be particularly passionate about their thing.\nWant to start a conversation with a D name? Do you know what they do for work? Ask them about it and thank me later."
    },

    "E" : {
        "Eleanor" : "* is quiet and awkward. She's generally well intentioned, but doesn't know how to act on it.",
        "Eli" : "*s are weird and offputting.",
        "Elijah" : "*s are all nerds, but they don't appear to be until you start talking to them. Getting them to open up is a decent challenge, though.\nThe quiet ones hardly talk at all, and the more extroverted ones are good conversationalists, but you could talk to them for hours and walk away konwing nothing about them.",
        "Elizabeth": "Socially awkward and kind of hard to talk to. They have a hard time understanding how their worldviews might not line up with others'. They're sweet, kindhearted, and have good intentions, quiet(er) in group settings, but will seek you out and talk your ear off seven ways from Sunday if they feel they're close enough to you (whether it's mutual or not).",
        "Ellie" : "*s are awesome. They're easy to talk to and great at carrying enjoyable conversations. *s make you feel at home in situations where you normally wouldn't.",
        "Emma" : "*s are laid-back and easygoing, but don't try to force a friendship. She'll open up to you when she feels as if you've earned it, so don't expect deep conversations off the bat.\nIf you're in a relaxed social setting, she's a great part of the conversation. Her humor is usually an undercurrent of her communication- she'll keep you laughing with consistant, deadpan jokes.",
        "Ema" : null,
        "Ethan" : "*s are all nerds, and they carry themselves as such. They're either very tall or relatively short with little in between.",
        "E Advice" : "Es are all socially awkward, disengaged, and hard to talk to (love y'all), but always endearing.\n They're one of two categories: loud and mentally down the street or quiet and mentally in the clouds.\nThey all have randomn hobbies that they will not tell you about, but by the time you ask, they're ridiculously good at it."
    },

    "F" : {
        "F Advice" : "F Advice"
    },

    "G" : {
        "G Advice" : "G Advice"
    },

    "H" : {
        "Hanna" : "*s will alway feel like they're a step ahead of you.\nMore successful, more mature, prettier, taller, more experienced- whatever it may be.\nThey're not- in reality, they're likely in the same position as you, thinking what you're thinking about her- about you.",
        "Hannah" : null,
        "H Advice" : "H Advice"
    },

    "I" : {
        "I Advice" : "I Advice"
    },

    "J" : {
        "Jack" : "*s are what we lovingly call obnoxious sweethearts. They really mean well, but likely have one or two prominent traits that will drive you up the wall.\nBe patient with your * - he needs it. After all, we all have our obnoxious traits. Take the time to know and understand him.",
        "Jacob" : "*s are usually kindhearted, but that kindheartedness might be buried under layers of more offputting personality traits or habits.\nThose habits can usually can be overlooked, but not very easily. You'll have to work with your *, but his kindheartedness might make it easier and worth your while.",
        "James" : "* is a perpetual clown and he knows it. He lives for it. His sole purpose for a long time will be to egg people on and serve as the life of the party.",
        "Jay" : "Whether their name is actually * or they just go by it, cease and desist and don't ask any questions.\nIf you can't cease or desist, just stay polite and don't get too close.",
        "Jenna" : "*s are loveable oddballs. They don't like direct attention but they do enjoy standing out, typically when it comes to appearance.\nIt will take them time to find (or grow into) the skin they want to be in, and that will define them for a while.\nThey're great friends to have and they'll have you laughing within the first few minutes of conversation.\nGet to know your * and you'll have true friend for whatever season of life you're in.",
        "Jerry" : "*s are a little odd (maybe a lottle odd), and you might not know what to do with that at first.\nIf you find yourself unable to dismiss their quirks, they might be red flags. Consider stepping back from the relationship if that's the case, and objectively reassess.\nIf not, you've got yourself a good'un! One of those friends you call 'weird' and really mean it, but you love 'em.",
        "Jeremiah" : null,
        "Joel" : "*s are extroverted and funny, and they're a blast to have around.\nIt's likely that you'll never get really close with a * one-on-one, but he'll always be around in group settings.\n*s tend to be talented, one of those good-at-everything people, but they're not conceited about it. They will joke as if they are, but they're sweethearts about their skill.",
        "John" : "*s can be dangerous. You've got a 50-50 shot of getting a beautifully gentle or an intoxicatingly reckless *. \nIf the latter case is true, then tread lightly. You're not supposed to like this version of * because of all the stories, but you most likely will.\nAs long as you don't get too close, you've got a good setting-friend (eg. school-friend / work-friend).\nIf the former case is yours, fret not. Your * is a gentle giant, in personality and perhaps in stature.\nYou'll love talking to him; he may not be talkative, but he most certainly has a lot to say. Listen to your *.\nWord to the wise- never try to change a *- either type. They're set in their ways and if they're going to change, it'll be on their time and their dime.\nThey will not change for or because of you.",
        "Josh" : "* has a 50-50 shot of either being great or kind of the worst. He's usually sweet enough, on an acquaintance level at the very least.\nYou'll get more than you bargained for, whether for the better or worse. *'ll end up being a good person to confide in or a bit of a nightmare to deal with.\nRoll the dice on your *, and may luck be on your side.",
        "Joshua" : null,
        "Jo" : "A *! *s are usually pretty cool. They most definitely have some odd quirks, but they're lovable and nice to have around.\nThey have very distinct personalities, so have fun discovering all the different sides of your *.",
        "Joe" : null,
        "Joseph" : null,
        "Josiah" : null,
        "J Advice" : "Js can present trouble. It can really be a toss-up, and you'll likely be taking a shot in the dark when getting to know one.\nThey are the hardest to categorize of any single letter because of how much of a mixed bag they are as a group.\nGenerally, Js are pretty funny, or often do funny/stupid things that you can chuckle about later.\nJust make sure you watch out for a manipulative J, because they'll be very good at it.\nThe most important thing to keep in mind when dealing with a J: always know who you're dealing with."
    },

    "K" : {
        "Katie" : "You probably grew up with a * and she was probably a little wild. The way that your * is largely dependent on when you met her.\nIf you grew up with her, she might act differently toward you becaue of the history between you two. Perhaps you elevate the wildness in her, or maybe you tone it down.\nIf you didn't grow up with her, she'll likely be wild out the gate. You'll have to set your boundaries quickly in order to establish a lasting relationship.",
        "Katy" : null,
        "Kenny" : "If this is your *'s, it's because he wants to embrace extrovertedness. He donned the * personality to make that transition easier, as he's naturally ambi- or introverted.\nIf * is his actual name, he's probably all-in on his extrovertedness. He doesn't have to embrace it, he's born with it (he's Maybelline).",
        "Kenneth" : "*s are subdued and extremely introverted- perhaps painfully so. You will not know a * unless he wants you to know him.",
        "Kai" : null,
        "Kevin" : "*s grow up to take one of two paths. They all start out as lovable, if weird, in their childhoods and early teens.\nThey will either grow up in that weirdness until it makes them an offputting adult, or they seriously mellow out and end up being rather cool.",
        "K Advice" : "Your K is probably pretty chill. They tend to have a go-with-the-flow outlook on life, and are not easily stressed by abrupt change.\nIf you want to go on a spontaneous adventure, a K might be a good person to take with you."
    },

    "L" : {
        "Liz" : "*s are off the wall, extroverted, fun-loving ladies. They're probably a little too loud and have one too many odd stories to tell, but that's part of their charm. Keep your * around, she's a sweetheart.",
        "Lucas" : "A * is a confident young gentleman.\nMore often than not, he only speaks when he know what he's talking about. And you'll find he's often speaking.\n* is very smart, and whether he flaunts that intelligence freely or not, you'll soon learn that about him if you don't know it already.\nIf you don't already, listen closely to your *. You might learn something from him.",
        "Lukas" : null,
        "Luke" : null,
        "Lydia" : "*s are interesting. You might get a bit of a pretentious vibe from her when you first meet, and *s go either way.\nShe might really be pretentious, which is unfortuante. She will think she's better than you, and you'll see it in the way she treats others even if she never says it out loud.\n\nYou might get a * with whom you can get along on a surface level, but your relationship will never develop further than that.\n\nRarely, she might be a real sweetheart, though- first impressions aren't everything.\nShe's down to earth and doesn't think herself over others. She'll be quite a humble one.",
        "L Advice" : "Ls are intelligent, headstrong, and outspoken. Even introverted L-names are on the more talkative side.\nYou'll likely get a good friend out of an L, and rightly so. They make excellent company- don't ever be the smartest person in the room, they say, and an L will make sure you aren't.\nBecause of this, your biggest annoyance with an L might be that intelligence. If they have a big head about it, dealing with that will be annoying.\nKeep your L around, though. They're good for you, and you're probably good for them, too."
    },

    "M" : {
        "Madison" : "Your * is most likely pretty relaxed. She's not necessarily introverted, but she's quiet, and likely prefers to observe before speaking.\nShe probably has a few close friends with whom she is more relaxed; approach her while she's with them if you want the full effect of your *.",
        "Maddie" : "You've got a sweetheart on your hands. Your * may be a little spacey and might not be the most observant girl on the planet, but she's a loyal friend and a ton of fun.",
        "Mady" : null,
        "Maddy" : null,
        "Mary" : "Give Mary advice for different hyphens, eg. -Claire, -Kate, -Jane",
        "Max" : "*es are hard to know and hard to get to know. They tend to keep to themselves and are very good at floating on the waters of menial conversation.\nThey're generally agreeable, though, so take your time with them and you'll get a good setting-friend.",
        "Maxwell" : null,
        "Maximillion" : null,
        "Michael" : "You have a 50-50 shot with your *: either the two of you click right away or clash hard. There's usually no in between.\nIf you click, then you'll  likely end up with an setting-based relationship (eg. work-friend or school-friend). He will be your buddy through and through.\nIf you clash, do not fret, all is not lost. You will have to smooth out the bumps in your dynamic, but once you do, work from there. Work hard and the relationship will prosper.",
        "M Advice" : "M Advice"
    },

    "N" : {
        "Nathan" : "It's hard to know a *. He doesn't wear his heart on his sleeve and he won't open up to you immediately.\nHe's probably introverted and definitely quiet.\nGive him time- he'll come around when he's ready and you'll be amiable in no time.",
        "Nicholas" : "*es are stubborn, and that is their shining, defining trait. If he introduces himself as * to you, you'll likely never get to call him Nick.\nHe's set in his ways and is comfortable there. Try not to upheave him too much, or he'll push back.",
        "Nick" : "*s can be dangerous. You've got a 50-50 shot of getting a beautifully gentle or an intoxicatingly reckless *. \nIf the latter case is true, then tread lightly. You're not supposed to like this version of * because of all the stories, but you most likely will.\nAs long as you don't get too close, you've got a good setting-friend (eg. school-friend / work-friend).\nIf the former case is yours, fret not. Your * is a gentle giant, in personality and perhaps in stature.\nYou'll love talking to him; he may not be talkative, but he most certainly has a lot to say. Listen to your *.\nWord to the wise- never try to change a * - either type. They're set in their ways and if they're going to change, it'll be on their time and their dime.\nThey will not change for or because of you.",
        "Nico" : "* will be one of two things as he grows up: playful or emo.\nIf you grew up with him, you saw one of those traits manifest in him firsthand and the different phases it went through.\nHe might be both, though, and in that case, he'll eventually grow out of the emo, but never out of the playful.",
        "N Advice" : "N names are usually fun, approachable, and ambiverted.\nYou might have to approach them first, but you'll be glad you did. They make solid friends and are easy to talk to.\nNs are usually pretty loyal, too, so don't worry about them talking behind your back. Keep one near to you and you'll be glad you did."
    },

    "O" : {
        "Olive" : "Be careful, *s are especially wild.\nAn * would be the kid in your group who was a biter, and ran around with scissors because she knew it scared people and she liked that.",
        "Olivia" : null,
        "Opal" : "Run. * is absolutely out of her mind. \nIf an Olive or Olivia is crazy, an * is three tiers above her. Oliv(e/ia) liked to run with scissors, * liked to stab people with them.",
        "O Advice" : "The personality of an O is dependent on their gender.\nIf your O is a girl, she's crazy. If he's a boy, you're more likely to meet a pretty mellow guy. ~elaborate~"
    },

    "P" : {
        "P Advice" : "P Advice"
    },

    "Q" : {
        "Q Advice" : "Q Advice"
    },

    "R" : {
        "Robert" : "*s aren't inherently bad or ill-meaning people, but they are inherently flaky.\nYou might want to avoid serious relationships with them until they've done some serious introspection and growing up.",
        "Ryan" : "There is a difference in advice between whether your Ryan is male or female.\nEverybody is going to like your girl * and it's going to annoy you. She's likely popular and everyone wants to be her friend.\nIf you two grew up together, you may drift apart if she isn't as keen on you as you are on her. The popularity likely will get to her head a bit.\nDon't give up on her, though. She'll come back around.\n\nGuy *s are a toss-up. If he's a jock, he's perpetually cocky, whether they let you know it or not.\nIf he's also an extrovert, he likely jokingly pretend to be cocky to distract from actual cockiness and he believes he has everyone fooled.\nIf he's an introvert, he likely believes he's better than other people at a lot of things. He doesn't necessarily think he's a better person, though.\nEither way, your *'s a good person. He may be cocky, but it could be for good reason. Even if it isn't, love on your Ryan anyway. He's good to have around.\n\nNon-jock *s are pretty relaxed. He's a good conversationalist but likely quiet, won't open up but will be vulnerable in the right situations. Read the room with your *.",
        "R Advice" : "R Advice"
    },

    "S" : {
        "Sabrina" : "*s are excellent ladies all around. How open they are with you is a toss-up depending on whether you get an introverted or an extraverted one.\nIn either scenario, * is someone  you want to hold close to you. She's a good listener and a good friend, and always has a smile and a silver lining for you.",
        "Sam" : "*s are always pretty cool, particularly if they go by '*' as a nickname.\nYou really can't go wrong with a *. Heads up- if you want one to open up to you, you'll need to work at it.\nThey tend to be introverted, but they come off as extroverts and they play that role well. They aren't so great at sharing their emotions. Be patient with them.",
        "Samuel" : null,
        "Sky" : "Does your * have a toxic trait? Yes. But we all do, and lucky for us, *s usually only have one.\nThey might need some direction or help in curbing that trait, but you aren't obligated to be the bearer of help- keep that in mind.\nOverall, *s are great friends, and you'll want to keep them around.",
        "Skye" : null,
        "Sofi" : "Wild. She's up there with the most wild girls there are. You'll have a hard time reigning her in, but she's highly entertaining to have around.\nHowever, you're in luck. While your * is wild, she's not crazy. It's not impossible to really get to know a * - you just have to make sure she's listening.",
        "Sophi" : null,
        "Sofia" : "Ah, *s are usually party animals. They're a litle wild and tend to develop a 'dgaf' attitude toward toward everything.\nIt's likely that she'll mellow out a bit in the future, but she'll never lose that party spirit.",
        "Sophia" : null,
        "S Advice" : "Ss are fun to hang around. They're usually down for a good time.\nThey may take a minute to open up, but once they do, you have a solid friend and person to be around."
    },

    "T" : {
        "Tiffany" : "*s will likely annoy you. They might come across as shallow due to their desire to be liked.\nThey crave attention and others' validation, so keep that in mind when approaching.\nYou can have a good relationship with a * as long as you keep this in mind.",
        "Tyler" : "Tyler is going to annoy the crap out of you, but you're going to love every second you spend with them.\nYou're going to wonder why you're friends with them and what you'd do without them on a daily basis, simultaneously.\nThey're one of those friends that will have you constantly joking that 'you don't know why you put up with them', but heres why you do:\n*s can be blast to have around, all in all. They pick up on humor and dynamic quickly, and once they do, it's all over- you're stuck with a great friend.",
        "T Advice" : "T Advice"
    },

    "U" : {
        "U Advice" : "U Advice"
    },

    "V" : {
        "Vanessa" : "Now here, you have an exception. Your * is a V, and she still does have that propsensity for evil (if this is unclear, read the General Advice).\nHowever, she does have the lowest possible propensity out of all the other V girls to rise to that evil.\nAnd if she doesn't rise to it, she may fall into the trap of becoming harmless, whereas the rest of the Vs will likely become peaceful.",
        "Violet" : null,
        "V Advice" : "Vs as a whole are usually pretty cool, but there are differences if you have a girl or guy V.\nVs are more generally inclined to be more chill if they are male.\n\nV girls are an interesting bunch. They have the highest propensity for evil out of all other girl names.\nNote that this doesn't mean your V will be evil, but Vs are simply more likely to be evil than any other girls. And if she is evil, you will see it.\nIf she does not rise to the occasion of being evil, then she will end up being a rather peaceful girl.\nDespite the aforementioned propensity, they make good friends, as long as they don't rise to that evil. They'll be just as cool as the guys.\n\nOverall, watch them close- if you see things you don't like, keep your distance. If they seem fine, they probably are, and they're great friends to have!"
    },

    "W" : {
        "Will" : "*s are great! You can't really go wrong. They tend to be social introverts- they can hold a conversation well but won't necessarily look to start one.\nThey're solid friends and good folk to have around.",
        "William" : null,
        "W Advice" : "W Advice"
    },

    "X" : {
        "X Advice" : "X Advice"
    },

    "Y" : {
        "Y Advice" : "Y Advice"
    },

    "Z" : {
        "Zac" : "*s aren't quiet. At all. They tend to be loud and proud of it. They're your typical jocks on the surface, but have a few more intellectual levels to them, too.\nTake your time with your *. There's probably more depth to him than you realize.",
        "Zach" : null,
        "Zachary" : null,
        "Zaccary" : null,
        "Zack" : null,
        "Zak" : null,
        "Zoe" : "* enjoys being in the middle of things, but not necessarily being the middle of things.\nShe likes to be in the action and around others, making people laugh and being the talk of the party once it's over.\nShe doesn't enjoy being the center of attention all the time, or for extended periods of time, though.\n* is usually ambi- or extraverted, but she has her fair share of deep thoughts to share. You just need to be patient, as she'll share when she's ready.",
        "Zoë" : null,
        "Zoey" : null,
        "Z Advice" : "The personality of a Z is dependent on their gender.\nIf your Z is a boy, he's usually quiet, and lays low in conversation. You won't hear much from him. He's pretty reserved, and won't say much.\n\nGirl Zs are a little more extroverted, enjoy having others' attention, and tend to be conceited.\n They're a little haughty, and might think themselves better than others.\nDon't let that totally deter you- they can definitely be cool once you get to know them."
    }
}